cases/electrochemicalFoam/1mm_1D_binary/0.org/C_OH-
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2-devel                             |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object 	C_OH-;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 7000;

boundaryField
{
    topAndBottom 
    {
        type            empty;
    }
    
    currentCollector 
    {
        //type            calculatedGradient;
        type            faradayConcentration;
        //type            linearGradient;
        //fieldName       "i";
        //type            speciesFluxConcentration;
        value           uniform 0;
    }    

    separator
    {
        //type            fixedValue; 
        //value           uniform 7000;
        //type            calculatedGradient;
        //value           uniform 0;
        type            zeroGradient;
    }    

    frontAndBack 
    {
        type            empty;
    }

//    wall 
//    {
//        type            zeroGradient;
//        //type            calculatedGradient;
//        //value           uniform 0;
//    }    
}

// ************************************************************************* //
