cases/electrochemicalFoam/1mm_1D_binary/0.org/i
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      i;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 0 1 0];

internalField   uniform (0 0 0);

boundaryField
{
    topAndBottom
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
    currentCollector
    {
        //type            zeroGradient;
        //type            fixedValue;
        //value           uniform (1000 0 0);
        type            calculated;
    }
    separator
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
