cases/electrochemicalFoam/1mm_1D_binary/constant/reactions
species
(
    OH-
    K+
    H2O	
);

reactions
{
//    reaction01
//    {
//    	type 		irreversibleArrheniusReaction;
//    	reaction	"CH4 + 2O2 = CO2 + 2H2O";
//        A            5.2e16;
//        beta         0;
//        Ta           14906;
//        //A, b, T from Arhenius equation k =A T exp b exp (-E/RT)
//    }
}
